flat_plate_ext_graded/Allrun
blockMesh
icoFoam
touch flat_plate_ext.foam

